bit-finance/InformationRegisters/бит_ОписаниеОтчетовДляИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ОписаниеОтчетовДляИИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ФорматыВыгрузкиОтчетовВИИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ПоставщикиИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПоставщикиИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OpenAI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Gemini</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Yandex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GigaChat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RuTronix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_КомандыЗаполненияПроизвольныхПолейИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КомандыЗаполненияПроизвольныхПолейИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АссистентыИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныПромптов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Промпт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныПромптовИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_АссистентыИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_АссистентыИИ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_МоделиИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аватарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СлужебныеПромпты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Промпт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныПромптовИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/CommonModules/бит_ИскусственныйИнтеллект/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет взаимодействие с моделью ИИ.
//
// Параметры:
//	ЗапросПользователя - Строка, Массив - Текстовый запрос к модели или история диалога.
//	Ассистент - СправочникСсылка.бит_Ассистекты - Ассистент для взаимодействия.
//
// Возвращаемое значение:
//	Строка.
//
Функция ОтветИИ(ЗапросПользователя, Знач Ассистент = Неопределено) Экспорт
	
	Возврат Обработки.бит_ВзаимодейтсвиеСИИ.ОтветАссистента(ЗапросПользователя, Ассистент);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыАссистента(Ассистент) Экспорт
	
	ПараметрыАссистента = Новый Структура;
	ПараметрыАссистента.Вставить("Поставщик");
	ПараметрыАссистента.Вставить("МетодОбработкиВложений");
	ПараметрыАссистента.Вставить("АдресРесурсаФайлов");
	ПараметрыАссистента.Вставить("ОбработчикРаспознаванияДокументов");
	ПараметрыАссистента.Вставить("АдресРесурсаФайлов");
	ПараметрыАссистента.Вставить("ВидМодели");
	ПараметрыАссистента.Вставить("КлючAPI");
	ПараметрыАссистента.Вставить("ИдентификаторКаталога");
	ПараметрыАссистента.Вставить("Модель");
	ПараметрыАссистента.Вставить("Температура");
	ПараметрыАссистента.Вставить("Поведение");
	ПараметрыАссистента.Вставить("ТехническиеУказания");
	ПараметрыАссистента.Вставить("ЭтоЯндекс");
	ПараметрыАссистента.Вставить("ЭтоСбер");
	ПараметрыАссистента.Вставить("ЭтоGemini");
	
	РеквизитыАссистента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ассистент,
		"Наименование, Модель, Температура, Идентификация, Инструкции");
	Модель = РеквизитыАссистента.Модель;
	ПараметрыАссистента.Модель      = Модель;
	ПараметрыАссистента.Температура = РеквизитыАссистента.Температура / 10;
	
	ПараметрыАссистента.Поведение =
	СтрШаблон("# Identity
	|
	|* You name are %1.
	|* %2.", РеквизитыАссистента.Наименование, РеквизитыАссистента.Идентификация);
	
	Если НЕ ПустаяСтрока(РеквизитыАссистента.Инструкции) Тогда
		ПараметрыАссистента.Поведение = ПараметрыАссистента.Поведение +
		"
		|
		|# Instructions
		|
		|" + РеквизитыАссистента.Инструкции;
	КонецЕсли;
	
	ПараметрыАссистента.ТехническиеУказания = ТехническиеУказанияАссистента(Ассистент);
	
	РеквизитыМодели = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Модель,
		"Поставщик, АдресСервера, АдресРесурса, ПортСервера, ИспользоватьБезопасноеСоединение,
		|МетодОбработкиВложений, АдресРесурсаФайлов, ОбработчикРаспознаванияДокументов, ВидМодели, ТарифGigaChat,
		|ИспользоватьПрокси, ПроксиСервер, ПроксиПорт, ПроксиИспользоватьАутентификациюОС, ПроксиПользователь");
	ЗаполнитьЗначенияСвойств(ПараметрыАссистента, РеквизитыМодели);
	АдресРесурса                  = РеквизитыМодели.АдресРесурса;
	ПараметрыАссистента.ЭтоЯндекс = (РеквизитыМодели.Поставщик = Перечисления.бит_ПоставщикиИИ.Yandex);
	ПараметрыАссистента.ЭтоСбер   = (РеквизитыМодели.Поставщик = Перечисления.бит_ПоставщикиИИ.GigaChat);
	ПараметрыАссистента.ЭтоGemini = (РеквизитыМодели.Поставщик = Перечисления.бит_ПоставщикиИИ.Gemini);
	
	ХранимыеПараметры = ХранимыеПараметрыМодели(Модель);
	ЗаполнитьЗначенияСвойств(ПараметрыАссистента, ХранимыеПараметры);
	Если ПараметрыАссистента.ЭтоGemini Тогда
		АдресРесурса = "%1/%2:generateContent";
		АдресРесурса = СтрШаблон(АдресРесурса, РеквизитыМодели.АдресРесурса, НРег(ПараметрыАссистента.ВидМодели));
		Если НЕ ПустаяСтрока(ПараметрыАссистента.КлючAPI) Тогда
			АдресРесурса = АдресРесурса + "?key=" + ПараметрыАссистента.КлючAPI;
		КонецЕсли;
	ИначеЕсли ПараметрыАссистента.ЭтоСбер Тогда
		ПолучитьТокенGigaChat(ПараметрыАссистента, РеквизитыМодели);
	КонецЕсли;
	
	ПараметрыСервера = Новый Структура;
	ПараметрыСервера.Вставить("Сервер",       РеквизитыМодели.АдресСервера);
	ПараметрыСервера.Вставить("Ресурс",       АдресРесурса);
	ПараметрыСервера.Вставить("РесурсФайлов", РеквизитыМодели.АдресРесурсаФайлов);
	ПараметрыСервера.Вставить("Порт",         ?(ЗначениеЗаполнено(РеквизитыМодели.ПортСервера),
		РеквизитыМодели.ПортСервера, Неопределено));
	ПараметрыСервера.Вставить("ИспользоватьБезопасноеСоединение", РеквизитыМодели.ИспользоватьБезопасноеСоединение);
	ПараметрыАссистента.Вставить("ПараметрыСервера", ПараметрыСервера);
	
	ПараметрыПрокси = Новый Структура;
	ПараметрыПрокси.Вставить("ИспользоватьПрокси",           РеквизитыМодели.ИспользоватьПрокси);
	ПараметрыПрокси.Вставить("Сервер",                       РеквизитыМодели.ПроксиСервер);
	ПараметрыПрокси.Вставить("Порт",                         ?(ЗначениеЗаполнено(РеквизитыМодели.ПроксиПорт),
		РеквизитыМодели.ПроксиПорт, Неопределено));
	ПараметрыПрокси.Вставить("ИспользоватьАутентификациюОС", РеквизитыМодели.ПроксиИспользоватьАутентификациюОС);
	ПараметрыПрокси.Вставить("Пользователь",                 РеквизитыМодели.ПроксиПользователь);
	ПараметрыПрокси.Вставить("Пароль",                       ХранимыеПараметры.ПарольПрокси);
	ПараметрыАссистента.Вставить("ПараметрыПрокси", ПараметрыПрокси);
	
	Возврат ПараметрыАссистента;
	
КонецФункции

Процедура ДобавитьКомандыВзаимодействия(Форма, ЭлементРодитель = Неопределено) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьИскусственныйИнтеллект") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Использование", Метаданные.Обработки.бит_ВзаимодейтсвиеСИИ) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомандыОбсужденияВариантовСИИ(Форма, ЭлементРодитель);
	ДобавитьКомандуНовогоВариантаВзаимодейсвия(Форма, ЭлементРодитель);
	
КонецПроцедуры

Процедура ДобавитьКомандыОбсужденияВариантовСИИ(Форма, ЭлементРодитель = Неопределено) Экспорт
	
	ИмяТаблицыОписаний  = "бит_ОписанияОтчетаДляИИ";
	ЭтоОбновлениеКоманд = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяТаблицыОписаний);
	
	ТекущиеВарианты = Новый Массив;
	Если ЭтоОбновлениеКоманд Тогда
		Для каждого СтрокаОписания Из Форма[ИмяТаблицыОписаний] Цикл
			ТекущиеВарианты.Добавить(СтрокаОписания.ВариантОтчета);
		КонецЦикла;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "ОбщаяФорма.ФормаОтчета" Тогда
		ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(Форма.НастройкиОтчета.ПолноеИмя);
	Иначе
		ЧастиИмениФормы = СтрРазделить(Форма.ИмяФормы, ".");
		ИмяОбъекта      = СтрШаблон("%1.%2", ЧастиИмениФормы[0], ЧастиИмениФормы[1]);
		ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяОбъекта);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеОтчетов.ВариантОтчета КАК ВариантОтчета,
	|	ОписаниеОтчетов.Описание КАК Описание,
	|	ОписаниеОтчетов.ФорматВыгрузки КАК ФорматВыгрузки
	|ИЗ
	|	РегистрСведений.бит_ОписаниеОтчетовДляИИ КАК ОписаниеОтчетов
	|ГДЕ
	|	ОписаниеОтчетов.Отчет = &Отчет
	|	И НЕ ОписаниеОтчетов.ВариантОтчета В(&ТекущиеВарианты)";
	Запрос.УстановитьПараметр("Отчет", ОбъектСистемы);
	Запрос.УстановитьПараметр("ТекущиеВарианты", ТекущиеВарианты);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоОбновлениеКоманд Тогда
		ОписаниеСтрока = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
		ОписаниеФорматыВыгрузки = Новый ОписаниеТипов("ПеречислениеСсылка.бит_ФорматыВыгрузкиОтчетовВИИ");

		ДобавляемыеРеквизиты = Новый Массив;
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицыОписаний, Новый ОписаниеТипов("ТаблицаЗначений")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяКомандыВзаимодействия", ОписаниеСтрока, ИмяТаблицыОписаний));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВариантОтчета", ОписаниеСтрока, ИмяТаблицыОписаний));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Описание", ОписаниеСтрока, ИмяТаблицыОписаний));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ФорматВыгрузки", ОписаниеФорматыВыгрузки, ИмяТаблицыОписаний));
															
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	ПодменюВзаимодействия     = ПодменюВзаимодействияСИИ(Форма, ЭлементРодитель);
	КомандаДобавленияВарианта = Форма.Элементы.Найти("бит_ДобавитьОписаниеОтчетаДляИИ");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторКоманды = Новый УникальныйИдентификатор;
		
		ИмяКомандыВзаимодействия = "бит_ОбсудитьСИИ_" + СтрЗаменить(Строка(ИдентификаторКоманды), "-", "_");
		
		КомандаОбсудитьСИИ = Форма.Команды.Добавить(ИмяКомандыВзаимодействия);
		КомандаОбсудитьСИИ.Действие  = "бит_Подключаемый_ОбсудитьСИИ";
		КомандаОбсудитьСИИ.Заголовок = ?(ПустаяСтрока(Выборка.ВариантОтчета), НСтр("ru='Общий вариант'"),
										Выборка.ВариантОтчета);
		КомандаОбсудитьСИИ.Картинка  = БиблиотекаКартинок.бит_ИскусственныйИнтеллект;
		
		КнопкаОбсудитьСИИ = Форма.Элементы.Вставить(ИмяКомандыВзаимодействия, Тип("КнопкаФормы"), ПодменюВзаимодействия,
													КомандаДобавленияВарианта);
		КнопкаОбсудитьСИИ.ИмяКоманды = ИмяКомандыВзаимодействия;
		
		НоваяСтрокаКоманды = Форма.бит_ОписанияОтчетаДляИИ.Добавить();	
		НоваяСтрокаКоманды.ИмяКомандыВзаимодействия = ИмяКомандыВзаимодействия;
		НоваяСтрокаКоманды.ВариантОтчета            = Выборка.ВариантОтчета;
		НоваяСтрокаКоманды.Описание                 = Выборка.Описание;
		НоваяСтрокаКоманды.ФорматВыгрузки           = Выборка.ФорматВыгрузки;
	КонецЦикла;
	
КонецПроцедуры

// Функция определяет дату диалогов с ИИ, до которой записи считаются не актуальными.
//
// Возвращаемое значение:
//	Дата.
//
Функция ГраницаАктуальнойИстории() Экспорт
	
	ХранениеИсторииДней = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_СрокХраненияИсторииДиалоговИИ");
	Если НЕ ЗначениеЗаполнено(ХранениеИсторииДней) Тогда
		ХранениеИсторииДней = 30;
	КонецЕсли;
	
	АктуальнаяДата = ТекущаяДатаСеанса() - (ХранениеИсторииДней * 86400);
	Возврат АктуальнаяДата;
	
КонецФункции

Функция ОписаниеЭлементовФормы(Форма, МетаданныеОбъекта = Неопределено) Экспорт
	
	Если МетаданныеОбъекта = Неопределено Тогда
		ПараметрыОбъекта  = СтрРазделить(Форма.ИмяФормы, ".");
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(СтрШаблон("%1.%2", ПараметрыОбъекта[0], ПараметрыОбъекта[1]));
		Если МетаданныеОбъекта = Неопределено Тогда
			Возврат Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента");
	ТаблицаЭлементов.Колонки.Добавить("Синоним");
	ТаблицаЭлементов.Колонки.Добавить("ПутьКДанным");
	ТаблицаЭлементов.Колонки.Добавить("ТипЗначения");
	ТаблицаЭлементов.Колонки.Добавить("ТекущееЗначение");
	
	Для каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) <> Тип("ПолеФормы") ИЛИ ПустаяСтрока(ЭлементФормы.ПутьКДанным) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементФормы.ПутьКДанным;
		
		ПараметрыРеквизита = Новый Структура("Синоним, ТипЗначения");
		Если СтрНачинаетсяС(ПутьКДанным, "Объект.") Тогда
			ИмяРеквизита = Сред(ПутьКДанным, 8);
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизита) Тогда
				Реквизит = МетаданныеОбъекта.СтандартныеРеквизиты[ИмяРеквизита];
			Иначе
				Реквизит = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита);
			КонецЕсли;
			Если Реквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ПараметрыРеквизита.Синоним     = ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
			ПараметрыРеквизита.ТипЗначения = Реквизит.Тип;
		ИначеЕсли СтрНачинаетсяС(ПутьКДанным, "ДополнительныйРеквизитЗначение_") Тогда
			Реквизит = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(Форма.Свойства_ОписаниеДополнительныхРеквизитов,
						Новый Структура("ИмяРеквизитаЗначение", ПутьКДанным));
			Если Реквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ПараметрыРеквизита.Синоним     = Реквизит.Наименование;
			ПараметрыРеквизита.ТипЗначения = Реквизит.ТипЗначения;
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтрокаЭлемента = ТаблицаЭлементов.Добавить();
		СтрокаЭлемента.ИмяЭлемента = ЭлементФормы.Имя;
		СтрокаЭлемента.ПутьКДанным = ПутьКДанным;
		СтрокаЭлемента.Синоним     = ЭлементФормы.Заголовок;
		Если ПустаяСтрока(СтрокаЭлемента.Синоним) Тогда
			СтрокаЭлемента.Синоним = ПараметрыРеквизита.Синоним;
		КонецЕсли;
		СтрокаЭлемента.ТипЗначения = ПараметрыРеквизита.ТипЗначения;
		
		МассивПутиКДанным = СтрРазделить(ПутьКДанным, ".");
		ТекущееЗначение   = Форма;
		Для каждого ЭлементПути Из МассивПутиКДанным Цикл
			ТекущееЗначение = ТекущееЗначение[ЭлементПути];
		КонецЦикла;
		СтрокаЭлемента.ТекущееЗначение = ТекущееЗначение;
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЭлементов);
	
КонецФункции

#Область ЗаполнениеДанныхФорм

Процедура ДобавитьКомандуЗаполнения(Форма, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьИскусственныйИнтеллект") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Использование", Метаданные.Обработки.бит_ВзаимодейтсвиеСИИ) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаРодителя = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры,
							"ИмяЭлементаДляРазмещения", "ФормаКоманднаяПанель");
	ЭлементРодитель     = Форма.Элементы.Найти(ИмяЭлементаРодителя);
	Если ЭлементРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "бит_ЗаполнитьСИИ";
	КомандаЗаполнитьСИИ = Форма.Команды.Добавить(ИмяКоманды);
	КомандаЗаполнитьСИИ.Действие  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры,
										"ИмяОбработчика", "Подключаемый_ЗаполнитьСИИ");
	КомандаЗаполнитьСИИ.Заголовок = НСтр("ru='Заполнить с AI'");
	КомандаЗаполнитьСИИ.Картинка  = БиблиотекаКартинок.бит_ИскусственныйИнтеллект;
	КомандаЗаполнитьСИИ.ИзменяетСохраняемыеДанные = Истина;
	КнопкаЗаполнитьСИИ = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементРодитель);
	КнопкаЗаполнитьСИИ.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

Процедура ДобавитьКомандыЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Если НЕ ВыполненыУсловияДляВзаимодействияСИИ(Форма, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ВычислитьПараметрыЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры);
	СоздатьТаблицуКомандЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры);
	ЗаполнитьТаблицуКомандЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры);
	НастроитьКомандыЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

Процедура РаспознатьДокумент(ДанныеДокумента, Результат, ОписаниеВложения, ПараметрыВзаимодействия) Экспорт
	
	Попытка
		Выполнить(ПараметрыВзаимодействия.ОбработчикРаспознаванияДокументов);
	Исключение
		Результат = НСтр("ru='Ошибка в обработчике распознавания документа: %1'");
		Результат = СтрШаблон(Результат, ОписаниеОшибки());
		ЗаписьЖурналаРегистрации("ИскусственныйИнтеллект", УровеньЖурналаРегистрации.Ошибка,,,Результат);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиКомандВзаимодействияВФормах

Функция ПодменюВзаимодействияСИИ(Форма, ЭлементРодитель)
	
	Элементы              = Форма.Элементы;
	ПодменюВзаимодействия = Элементы.Найти("бит_ПодменюВзаимодейсвиеСИИ");
	Если ПодменюВзаимодействия <> Неопределено Тогда
		Возврат ПодменюВзаимодействия;
	КонецЕсли;
	
	ПодменюВзаимодействия = Элементы.Добавить("бит_ПодменюВзаимодейсвиеСИИ", Тип("ГруппаФормы"),
								?(ЭлементРодитель = Неопределено, Элементы.ПодменюОтправить, ЭлементРодитель));
	ПодменюВзаимодействия.Вид       = ВидГруппыФормы.Подменю;
	ПодменюВзаимодействия.Заголовок = НСтр("ru='Обсудить с AI'");
	ПодменюВзаимодействия.Картинка  = БиблиотекаКартинок.бит_ИскусственныйИнтеллект;
	
	Возврат ПодменюВзаимодействия;
	
КонецФункции

Процедура ДобавитьКомандуНовогоВариантаВзаимодейсвия(Форма, ЭлементРодитель)
	
	Если НЕ ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.бит_ОписаниеОтчетовДляИИ) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "бит_ДобавитьОписаниеОтчетаДляИИ";
		
	КомандаОбсудитьСИИ = Форма.Команды.Добавить(ИмяКоманды);
	КомандаОбсудитьСИИ.Действие  = "бит_Подключаемый_ДобавитьОписаниеОтчетаДляИИ";
	КомандаОбсудитьСИИ.Заголовок = НСтр("ru='Добавить описание отчета для AI'");
	КомандаОбсудитьСИИ.Картинка  = БиблиотекаКартинок.ДобавитьЭлементСписка;
	
	КнопкаОбсудитьСИИ = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПодменюВзаимодействияСИИ(Форма, ЭлементРодитель));
	КнопкаОбсудитьСИИ.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПроизвольныхПолей

Функция ВыполненыУсловияДляВзаимодействияСИИ(Форма, ДополнительныеПараметры)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьИскусственныйИнтеллект") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Использование", Метаданные.Обработки.бит_ВзаимодейтсвиеСИИ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяЭлементаРодителя = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры,
							"ИмяЭлементаДляРазмещения", "ФормаКоманднаяПанель");
	ЭлементРодитель     = Форма.Элементы.Найти(ИмяЭлементаРодителя);
	Если ЭлементРодитель = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ЭлементРодитель", ЭлементРодитель);
	
	Возврат Истина;
	
КонецФункции

Процедура ВычислитьПараметрыЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры)
	
	ОбъектСистемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОбъектСистемы");
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда
		ЧастиИмениФормы = СтрРазделить(Форма.ИмяФормы, ".");
		ОбъектСистемы   = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(
							СтрШаблон("%1.%2", ЧастиИмениФормы[0], ЧастиИмениФормы[1]));
		ДополнительныеПараметры.Вставить("ОбъектСистемы", ОбъектСистемы);
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ИмяТаблицыКомандЗаполнения", "бит_КомандыЗаполненияПроизвольныхПолейИИ");
	ДополнительныеПараметры.Вставить("ЭтоОбновлениеКоманд", Ложь);
	
КонецПроцедуры

Процедура СоздатьТаблицуКомандЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры)
	
	ИмяТаблицыКомандЗаполнения = ДополнительныеПараметры.ИмяТаблицыКомандЗаполнения;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяТаблицыКомандЗаполнения) Тогда
		ДополнительныеПараметры.ЭтоОбновлениеКоманд = Истина;
		Возврат;
	КонецЕсли;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицыКомандЗаполнения, Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КомандаЗаполнения",
		Новый ОписаниеТипов("СправочникСсылка.бит_КомандыЗаполненияПроизвольныхПолейИИ"), ИмяТаблицыКомандЗаполнения));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяКомандыЗаполнения", ОписаниеСтрока, ИмяТаблицыКомандЗаполнения));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолеЗаполнения", ОписаниеСтрока, ИмяТаблицыКомандЗаполнения));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЗаголовокДействия", ОписаниеСтрока, ИмяТаблицыКомандЗаполнения));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Ассистент",
		Новый ОписаниеТипов("СправочникСсылка.бит_АссистентыИИ"), ИмяТаблицыКомандЗаполнения));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЗапросВложения",
		Новый ОписаниеТипов("Булево"), ИмяТаблицыКомандЗаполнения));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Промпты",
		Новый ОписаниеТипов("СписокЗначений"), ИмяТаблицыКомандЗаполнения));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуКомандЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры)
	
	ТаблицаКоманд = Форма[ДополнительныеПараметры.ИмяТаблицыКомандЗаполнения];
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомандыОбъектовСистемы.Ссылка КАК КомандаЗаполнения
	|ПОМЕСТИТЬ КомандыЗаполнения
	|ИЗ
	|	Справочник.бит_КомандыЗаполненияПроизвольныхПолейИИ.ОбъектыСистемы КАК КомандыОбъектовСистемы
	|ГДЕ
	|	КомандыОбъектовСистемы.ОбъектСистемы = &ОбъектСистемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомандыЗаполнения.КомандаЗаполнения КАК КомандаЗаполнения,
	|	КомандыСправочник.Ассистент КАК Ассистент,
	|	КомандыСправочник.ПолеЗаполнения КАК ПолеЗаполнения,
	|	КомандыСправочник.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
	|	КомандыСправочник.ЗапрашиватьФайл КАК ЗапрашиватьФайл,
	|	ШаблоныПромптовКоманд.НомерСтроки КАК НомерСтрокиПромпта,
	|	ШаблоныПромптовКоманд.Промпт КАК Промпт,
	|	КомандыСправочник.Наименование КАК Наименование
	|ИЗ
	|	КомандыЗаполнения КАК КомандыЗаполнения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_КомандыЗаполненияПроизвольныхПолейИИ КАК КомандыСправочник
	|		ПО КомандыЗаполнения.КомандаЗаполнения = КомандыСправочник.Ссылка
	|			И (НЕ КомандыСправочник.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_КомандыЗаполненияПроизвольныхПолейИИ.ШаблоныПромптов КАК ШаблоныПромптовКоманд
	|		ПО КомандыЗаполнения.КомандаЗаполнения = ШаблоныПромптовКоманд.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КомандыСправочник.Наименование,
	|	НомерСтрокиПромпта
	|ИТОГИ
	|	МАКСИМУМ(Ассистент),
	|	МАКСИМУМ(ПолеЗаполнения),
	|	МАКСИМУМ(ПользовательскоеУсловие),
	|	МАКСИМУМ(ЗапрашиватьФайл),
	|	МАКСИМУМ(Наименование)
	|ПО
	|	КомандаЗаполнения";
	Запрос.УстановитьПараметр("ОбъектСистемы", ДополнительныеПараметры.ОбъектСистемы);
	ВыборкаКоманд = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаКоманд.Очистить();
	Пока ВыборкаКоманд.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаКоманд.ПользовательскоеУсловие) Тогда
			ПараметрыПроверки = Новый Структура("ТекущийОбъект", ДополнительныеПараметры.Объект);
			Если НЕ бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(ВыборкаКоманд.ПользовательскоеУсловие, ПараметрыПроверки) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИдентификаторКоманды = Строка(ВыборкаКоманд.КомандаЗаполнения.UUID());
		НоваяКоманда = ТаблицаКоманд.Добавить();
		НоваяКоманда.КомандаЗаполнения    = ВыборкаКоманд.КомандаЗаполнения;
		НоваяКоманда.ИмяКомандыЗаполнения = "бит_ЗаполнитьПроизвольноеПоле_" + СтрЗаменить(ИдентификаторКоманды, "-", "");
		НоваяКоманда.ПолеЗаполнения       = ВыборкаКоманд.ПолеЗаполнения;
		НоваяКоманда.ЗаголовокДействия    = ВыборкаКоманд.Наименование;
		НоваяКоманда.Ассистент            = ВыборкаКоманд.Ассистент;
		НоваяКоманда.ЗапросВложения       = ВыборкаКоманд.ЗапрашиватьФайл;
		ВыборкаПромптов = ВыборкаКоманд.Выбрать();
		Пока ВыборкаПромптов.Следующий() Цикл
			НоваяКоманда.Промпты.Добавить(ВыборкаПромптов.Промпт);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура НастроитьКомандыЗаполненияПроизвольныхПолей(Форма, ДополнительныеПараметры)
	
	ТаблицаКоманд = Форма[ДополнительныеПараметры.ИмяТаблицыКомандЗаполнения];
	
	Если ДополнительныеПараметры.ЭтоОбновлениеКоманд Тогда
		Для каждого КомандаФормы Из Форма.Команды Цикл
			ИмяКоманды = КомандаФормы.Имя;
			Если НЕ СтрНачинаетсяС(ИмяКоманды, "бит_ЗаполнитьПроизвольноеПоле_") Тогда
				Продолжить;
			КонецЕсли;
			
			КомандыЗаполнения = ТаблицаКоманд.НайтиСтроки(Новый Структура("ИмяКомандыЗаполнения", ИмяКоманды));
			Если КомандыЗаполнения.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементФормы = Форма.Элементы.Найти(ИмяКоманды);
			Если ЭлементФормы <> Неопределено Тогда
				Форма.Элементы.Удалить(ЭлементФормы);
			КонецЕсли;
			
			КомандаФормы = Форма.Команды.Найти(ИмяКоманды);
			Если КомандаФормы <> Неопределено Тогда
				Форма.Команды.Удалить(КомандаФормы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаКоманды Из ТаблицаКоманд Цикл
		ИмяКоманды = СтрокаКоманды.ИмяКомандыЗаполнения;
		Если Форма.Команды.Найти(ИмяКоманды) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КомандаЗаполнитьСИИ = Форма.Команды.Добавить(ИмяКоманды);
		КомандаЗаполнитьСИИ.Действие  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры,
											"ИмяОбработчика", "Подключаемый_ЗаполнитьПроизвольноеПолеСИИ");
		КомандаЗаполнитьСИИ.Заголовок = СтрокаКоманды.ЗаголовокДействия;
		КомандаЗаполнитьСИИ.Картинка  = БиблиотекаКартинок.бит_ИскусственныйИнтеллект;
		КомандаЗаполнитьСИИ.ИзменяетСохраняемыеДанные = Истина;
		КнопкаЗаполнитьСИИ = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ДополнительныеПараметры.ЭлементРодитель);
		КнопкаЗаполнитьСИИ.ИмяКоманды = ИмяКоманды;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ХранимыеПараметрыМодели(Модель)
	
	УстановитьПривилегированныйРежим(Истина);
	ХранимыеПараметры = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Модель,
							"КлючAPI, ИдентификаторКаталога, ПарольПрокси");
	Если ХранимыеПараметры.ПарольПрокси = Неопределено Тогда
		ХранимыеПараметры.ПарольПрокси = "";
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ХранимыеПараметры;
	
КонецФункции

Процедура ПолучитьТокенGigaChat(ПараметрыАссистента, ПараметрыМодели)
	
	ПараметрыЗапроса = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресСервера = "ngw.devices.sberbank.ru";
	ПараметрыЗапроса.Порт         = 9443;
	ПараметрыЗапроса.АдресРесурса = "api/v2/oauth";
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ПараметрыЗапроса.Заголовки.Вставить("RqUID", Строка(Новый УникальныйИдентификатор()));
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Basic " + ПараметрыАссистента.КлючAPI);
	ПараметрыЗапроса.ТелоЗапроса = СтрШаблон("scope=%1", ПараметрыМодели.ТарифGigaChat);
	
	РезультатЗапроса = бит_ИскусственныйИнтеллектКлиентСервер.РезультатHTTPЗапроса(ПараметрыЗапроса);
	Если РезультатЗапроса.ЗапросВыполнен Тогда
		ПараметрыАссистента.КлючAPI = РезультатЗапроса.ОтветСервера["access_token"];
	Иначе
		ПараметрыАссистента.КлючAPI = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ТехническиеУказанияАссистента(Ассистент)
	
	ТехническиеУказания = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СлужебныеПромпты.НомерСтроки КАК НомерСтроки,
	|	СлужебныеПромпты.Промпт.Содержание КАК ПромптСодержание
	|ИЗ
	|	Справочник.бит_АссистентыИИ.СлужебныеПромпты КАК СлужебныеПромпты
	|ГДЕ
	|	СлужебныеПромпты.Ссылка = &Ассистент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ассистент", Ассистент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ТехническиеУказания;
	КонецЕсли;
	
	СлужебныеПромпты    = Результат.Выгрузить().ВыгрузитьКолонку("ПромптСодержание");
	ТехническиеУказания = СтрСоединить(СлужебныеПромпты, ";" + Символы.ПС);
	
	Возврат ТехническиеУказания;
	
КонецФункции

#КонецОбласти
